      ******************************************************************
      * Author:Rodrigo Correia
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION                              DIVISION.
       PROGRAM-ID. PROGRA001.
       AUTHOR. RODRIGO CORREIA.

      *=================================================================*
       ENVIRONMENT                                 DIVISION.
      *=================================================================*
      *-----------------------------------------------------------------*
       CONFIGURATION                        SECTION.
      *-----------------------------------------------------------------*

       SPECIAL-NAMES.

      *-----------------------------------------------------------------*
       INPUT-OUTPUT                        SECTION.
      *-----------------------------------------------------------------*

       FILE-CONTROL.

      *=================================================================*
       DATA                                        DIVISION.
      *=================================================================*
      *-----------------------------------------------------------------*
       FILE                                SECTION.
      *-----------------------------------------------------------------*
      *-----------------------------------------------------------------*
       WORKING-STORAGE SECTION.
      *-----------------------------------------------------------------*
      *=================================================================*
       PROCEDURE                                   DIVISION.
      *=================================================================*
       MAIN-PROCEDURE.
            DISPLAY "Hello world".
            STOP RUN.
       END PROGRAM PROGRA001.
